Catalogs/ЭлектронныеКурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЭлектронныеКурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерРедакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтартоваяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинальнаяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочнаяИнформация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глоссарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеГлоссарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Презентация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецЭлектронногоКурса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецЭлектронногоКурса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ГруппыЭлементовЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГруппыЭлементовЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТеорияЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ТерминыЭлектронныхГлоссариев</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеГлоссарии</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТестовыеВопросы</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеТесты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПубликацииЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПубликацииЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктураКурса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурсы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЭлектронныхКурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учебник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слайдовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SCORM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИзучениеЭлектронногоКурса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИзучениеЭлектронногоКурса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПопыткиИзученияЭлементовЭлектронныхКурсов</xr:Item>
				<xr:Item>InformationRegister.ОтветыНаТестовыеВопросы</xr:Item>
				<xr:Item>InformationRegister.ИзученныеЭлектронныеКурсы</xr:Item>
				<xr:Item>InformationRegister.ВыбранныеВариантыОтветовЭлектронныхВопросов</xr:Item>
				<xr:Item>InformationRegister.ИзученныеЭлементыЭлектронныхКурсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтекстЭлектронногоОбучения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учащийся</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчащийсяЭлектронногоОбучения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеИзучения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПоследнийЭлементСодержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтоТестовоеИзучение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтоРежимРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТестировщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПопыткиИзучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПопытки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СодержаниеЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СодержаниеЭлектронныхКурсов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭлектронныеКурсы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТеорияЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементыЭлектронныхРесурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеТесты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовСодержанияЭлектронногоКурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыЗапуска</Name>
					<Comment>Item / parameters</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Comment>limitConditions / attemptLimit</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПопытки</Name>
					<Comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогВыполнения</Name>
					<Comment>completionThreshold</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеИнициализации</Name>
					<Comment>dataFromLMS</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеПослеИстеченияВремени</Name>
					<Comment>timeLimitAction</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПослеИстеченияВремениЭлектронногоКурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Гиперссылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Привязка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресВДокументе</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭлектронныеКурсы/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
		
	Если ВидФормы = "ФормаОбъекта" Тогда
		ОбработкаПолученияФормыОбъектаЭлектронногоКурса(Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
	КонецЕсли;

	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	
	
// Возвращает группу нужного типа, в которую будут помещаться элементы электронного курса.
//
Функция ГруппаДляХраненияПодчиненныхЭлементов(Знач ЭлектронныйКурс, Знач ТипПодчиненногоЭлемента) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйКурс)
		ИЛИ НЕ ЗначениеЗаполнено(ТипПодчиненногоЭлемента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ГруппаПодчиненныхЭлементов = РегистрыСведений.ГруппыЭлементовЭлектронныхКурсов.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйКурс, ТипПодчиненногоЭлемента);
	
	Если ГруппаПодчиненныхЭлементов = Неопределено Тогда
		
		ИмяСправочника = Метаданные.НайтиПоТипу(ТипПодчиненногоЭлемента).Имя;
		
		НоваяГруппаОбъект =  Справочники[ИмяСправочника].СоздатьГруппу();
		НоваяГруппаОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйКурс, "Наименование");
		
		РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(НоваяГруппаОбъект);

		НоваяГруппаОбъект.Записать();
		
		ГруппаПодчиненныхЭлементов = НоваяГруппаОбъект.Ссылка;
		
		РегистрыСведений.ГруппыЭлементовЭлектронныхКурсов.СохранитьГруппуДляХраненияПодчиненныхЭлементов(ЭлектронныйКурс, ГруппаПодчиненныхЭлементов);
		
	КонецЕсли;
	
	Возврат ГруппаПодчиненныхЭлементов;
	
КонецФункции

// Добавляет элемент в содержание электронного курса
//
Функция ДобавитьЭлементСодержания(ЭлектронныйКурс, СсылкаНаЭлемент, Группа, ЭтоГруппа = Ложь, Наименование = Неопределено, ТипЭлемента = Неопределено, ЭлементСодержания = Неопределено, КонтекстРедактирования = Неопределено) Экспорт
	
	Если ЭтоГруппа Тогда
		ЭлементСодержанияОбъект = Справочники.СодержаниеЭлектронныхКурсов.СоздатьГруппу();
	Иначе
		ЭлементСодержанияОбъект = Справочники.СодержаниеЭлектронныхКурсов.СоздатьЭлемент();
    КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		ЭлементСодержанияОбъект.УстановитьСсылкуНового(ЭлементСодержания);
	КонецЕсли;
	
	Если Наименование = Неопределено И ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда		
		ЭлементСодержанияОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлемент, "Наименование");		
	Иначе		
		ЭлементСодержанияОбъект.Наименование = Наименование;			
	КонецЕсли;
	
	ЭлементСодержанияОбъект.Владелец = ЭлектронныйКурс;
	
	Если ЗначениеЗаполнено(СсылкаНаЭлемент)
		И НЕ ЭтоГруппа Тогда
		
		ЭлементСодержанияОбъект.Элемент = СсылкаНаЭлемент;
		
	КонецЕсли;

	Если ТипЗнч(Группа) = Тип("СправочникСсылка.СодержаниеЭлектронныхКурсов") Тогда
		ЭлементСодержанияОбъект.Родитель = Группа;
	КонецЕсли;
	
	РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(ЭлементСодержанияОбъект);	
	
	Если ЗначениеЗаполнено(ТипЭлемента) Тогда
		ЭлементСодержанияОбъект.ТипЭлемента = ТипЭлемента;
	Иначе				
		ЭлементСодержанияОбъект.ТипЭлемента = Справочники.СодержаниеЭлектронныхКурсов.ТипЭлементаПоСсылке(СсылкаНаЭлемент, ЭтоГруппа);
	КонецЕсли;		
	
	ЭлементСодержанияОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);
	ЭлементСодержанияОбъект.Записать();
	
	Возврат ЭлементСодержанияОбъект.Ссылка;
	
КонецФункции

Функция СоздатьЭлектронныйКурс(Наименование, ТипКурса, Родитель = Неопределено, КонтекстРедактирования = Неопределено) Экспорт
	
	ЭлектронныйКурсОбъект = Справочники.ЭлектронныеКурсы.СоздатьЭлемент();
	
	ЗаполнитьРеквизитыНовогоЭлектронногоКурса(ЭлектронныйКурсОбъект, Наименование, ТипКурса, Родитель, КонтекстРедактирования);  

	ЭлектронныйКурсОбъект.Записать();
	
	ЭлектронныйКурс = ЭлектронныйКурсОбъект.Ссылка;
	
	РазработкаЭлектронныхКурсовПереопределяемый.ПриЗаписиНовогоЭлектронногоКурса(ЭлектронныйКурс, КонтекстРедактирования);
	
	Возврат ЭлектронныйКурс;	
		
КонецФункции

Процедура ЗаполнитьРеквизитыНовогоЭлектронногоКурса(ЭлектронныйКурсОбъект, Наименование, ТипКурса, Родитель = Неопределено, КонтекстРедактирования) Экспорт
	
	ЭлектронныйКурсОбъект.Заполнить(Неопределено);
	
	ЭлектронныйКурсОбъект.Наименование  = Наименование;
	ЭлектронныйКурсОбъект.НомерРедакции = 0;
	ЭлектронныйКурсОбъект.Тип           = ТипКурса;
	ЭлектронныйКурсОбъект.Родитель      = Родитель;
	
	РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(ЭлектронныйКурсОбъект);
	
	ЭлектронныйКурсОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);	
	
КонецПроцедуры

Функция СкопироватьЭлектронныйКурс(Знач СтарыйЭлектронныйКурс, Знач КонтекстРедактирования = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ЭлектронныеКурсы");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", СтарыйЭлектронныйКурс);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();			
		
		// Делаем копию курса
		//
		
		НовыйЭлектронныйКурсОбъект = СтарыйЭлектронныйКурс.Скопировать();	
		НовыйЭлектронныйКурсОбъект.Наименование =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 - копия'"), НовыйЭлектронныйКурсОбъект.Наименование);
		НовыйЭлектронныйКурсОбъект.ДополнительныеСвойства.Вставить("ЭтоКопирование", Истина);
		НовыйЭлектронныйКурсОбъект.Записать();
		
		НовыйЭлектронныйКурс = НовыйЭлектронныйКурсОбъект.Ссылка;
		
		РазработкаЭлектронныхКурсовПереопределяемый.ПриЗаписиНовогоЭлектронногоКурса(НовыйЭлектронныйКурс, КонтекстРедактирования);
		
		// Делаем копии подчиненных элементов
		//
		
		ТаблицаСкопированныхЭлементов = Новый ТаблицаЗначений;
		ТаблицаСкопированныхЭлементов.Колонки.Добавить("СтарыйЭлемент");
		ТаблицаСкопированныхЭлементов.Колонки.Добавить("НовыйЭлемент");
		ТаблицаСкопированныхЭлементов.Колонки.Добавить("ТипЭлемента");
		
		СтарыеПодчиненныеЭлементы = РазработкаЭлектронныхКурсовСлужебный.ВсеСсылкиЭлементаСправочника(СтарыйЭлектронныйКурс, Истина, Истина);
		
		Для каждого СтарыйПодчиненныйЭлемент Из СтарыеПодчиненныеЭлементы Цикл			
			
			Если ТипЗнч(СтарыйПодчиненныйЭлемент) = Тип("СправочникСсылка.ПоставщикиЭлектронныхКурсов") Тогда
				Продолжить; // Поставщика не обрабатываем
			КонецЕсли;			
			
			ТипСтарогоЭлемента = ТипЗнч(СтарыйПодчиненныйЭлемент);
			ИмяСправочника = ЭлектронноеОбучениеСлужебный.ИмяСправочникаПоСсылке(СтарыйПодчиненныйЭлемент);
			
			НоваяСтрока = ТаблицаСкопированныхЭлементов.Добавить();
			НоваяСтрока.ТипЭлемента = ТипСтарогоЭлемента;
			НоваяСтрока.СтарыйЭлемент = СтарыйПодчиненныйЭлемент;
			
			Если ТипЗнч(СтарыйПодчиненныйЭлемент) = Тип("СправочникСсылка.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы") Тогда
				Продолжить; // Присоединенные файлы будут скопированы отдельным алгоритмом (см. ниже)
			КонецЕсли;			
			
			НовыйПодчиненныйЭлементОбъект = СтарыйПодчиненныйЭлемент.Скопировать();
			
			Если РазработкаЭлектронныхКурсовСлужебныйПовтИсп.СправочникИмеетКод(ИмяСправочника) Тогда
				НовыйПодчиненныйЭлементОбъект.Код = СтарыйПодчиненныйЭлемент.Код;
			КонецЕсли;
			
			Если РазработкаЭлектронныхКурсовСлужебныйПовтИсп.ЭтоИерархическийСправочник(ИмяСправочника)
				И НЕ РазработкаЭлектронныхКурсовСлужебныйПовтИсп.ЭтоПодчиненныйСправочник(ИмяСправочника) Тогда			
				НовыйПодчиненныйЭлементОбъект.Родитель = Справочники.ЭлектронныеКурсы.ГруппаДляХраненияПодчиненныхЭлементов(НовыйЭлектронныйКурс, ТипСтарогоЭлемента);				
			КонецЕсли;
			
			НовыйПодчиненныйЭлементОбъект.ДополнительныеСвойства.Вставить("ЭтоКопирование", Истина);
			НовыйПодчиненныйЭлементОбъект.ОбменДанными.Загрузка = Истина;
			НовыйПодчиненныйЭлементОбъект.Записать();
			
			НоваяСтрока.НовыйЭлемент = НовыйПодчиненныйЭлементОбъект.Ссылка;
			
		КонецЦикла;
		
		НоваяСтрока = ТаблицаСкопированныхЭлементов.Добавить();
		НоваяСтрока.СтарыйЭлемент = СтарыйЭлектронныйКурс;
		НоваяСтрока.НовыйЭлемент = НовыйЭлектронныйКурс;
		НоваяСтрока.ТипЭлемента = ТипЗнч(СтарыйЭлектронныйКурс);
		
		// Копируем файлы
		//
		
		// Находим все элементы ресурсов и копируем их файлы
		
		СтрокиСЭлементамиРесурсов = ТаблицаСкопированныхЭлементов.НайтиСтроки(Новый Структура("ТипЭлемента", Тип("СправочникСсылка.ЭлементыЭлектронныхРесурсов")));
		
		Для каждого СтрокаСЭлементомРесурса Из СтрокиСЭлементамиРесурсов Цикл									
			
			// Заполняем таблицу с новыми и старыми элементами
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПрисоединенныеФайлы.Ссылка КАК Ссылка,
				|	ПрисоединенныеФайлы.Размер КАК Размер,
				|	ПрисоединенныеФайлы.Наименование КАК Наименование,
				|	ПрисоединенныеФайлы.Расширение КАК Расширение
				|ИЗ
				|	Справочник.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы КАК ПрисоединенныеФайлы
				|ГДЕ
				|	ПрисоединенныеФайлы.ВладелецФайла = &СтарыйЭлементРесурса
				|	И ПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("СтарыйЭлементРесурса", СтрокаСЭлементомРесурса.СтарыйЭлемент);
			
			ФайлыСтарогоЭлемента = Запрос.Выполнить().Выгрузить();
			
			Если ФайлыСтарогоЭлемента.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Копируем физически файлы
			
			РаботаСФайламиСлужебный.СкопироватьПрисоединенныеФайлы(СтрокаСЭлементомРесурса.СтарыйЭлемент, СтрокаСЭлементомРесурса.НовыйЭлемент);			
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПрисоединенныеФайлы.Ссылка КАК Ссылка,
				|	ПрисоединенныеФайлы.Наименование КАК Наименование,
				|	ПрисоединенныеФайлы.Размер КАК Размер,
				|	ПрисоединенныеФайлы.Расширение КАК Расширение
				|ИЗ
				|	Справочник.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы КАК ПрисоединенныеФайлы
				|ГДЕ
				|	ПрисоединенныеФайлы.ВладелецФайла = &НовыйЭлементРесурса
				|	И ПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("НовыйЭлементРесурса", СтрокаСЭлементомРесурса.НовыйЭлемент);
			
			ФайлыНовогоЭлемента = Запрос.Выполнить().Выгрузить();
			
			Если ФайлыСтарогоЭлемента.Количество() <> ФайлыНовогоЭлемента.Количество() Тогда
				ВызватьИсключение НСтр("ru = 'Копирование файлов не выполнено'");
			КонецЕсли;
			
			Для каждого СтрокаФСЭ Из ФайлыСтарогоЭлемента Цикл
			
				СтрокиТСЭ = ТаблицаСкопированныхЭлементов.НайтиСтроки(Новый Структура("СтарыйЭлемент", СтрокаФСЭ.Ссылка));
				
				Если СтрокиТСЭ.Количество() <> 1 Тогда
					ВызватьИсключение НСтр("ru = 'Найдено более одного файла элемента ресурса для копирования'");
				КонецЕсли;
				
				СтрокаТСЭ = СтрокиТСЭ[0];
				
				СтрокиФНЭ = ФайлыНовогоЭлемента.НайтиСтроки(Новый Структура("Наименование, Размер, Расширение", СтрокаФСЭ.Наименование, СтрокаФСЭ.Размер, СтрокаФСЭ.Расширение));
				
				Если СтрокиФНЭ.Количество() <> 1 Тогда
					ВызватьИсключение НСтр("ru = 'Скопированный файл не найден'");
				КонецЕсли;					
				
			    СтрокаТСЭ.НовыйЭлемент = СтрокиФНЭ[0].Ссылка;
				
			КонецЦикла;	
				
		КонецЦикла;		
		
		// Заменяем старые ссылки на подчиненные элементы новыми
		//
		
		ЛокализованноеИмяРеквизитаВладелец = РазработкаЭлектронныхКурсовСлужебный.ПеревестиСтандартныйРеквизит(,"Owner");
		ЛокализованноеИмяРеквизитаРодитель = РазработкаЭлектронныхКурсовСлужебный.ПеревестиСтандартныйРеквизит(,"Parent");
		
		Для каждого Строка Из ТаблицаСкопированныхЭлементов Цикл
			
			Если НЕ ЗначениеЗаполнено(Строка.НовыйЭлемент) Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Элемент ""%1"" не скопирован. Тип: %2'"), Строка(Строка.СтарыйЭлемент), Строка(Строка.ТипЭлемента));
			КонецЕсли;
			
			ИмяСправочника = ЭлектронноеОбучениеСлужебный.ИмяСправочникаПоСсылке(Строка.СтарыйЭлемент);
			ВсеСсылкиСправочника =  РазработкаЭлектронныхКурсовСлужебныйПовтИсп.ВсеСсылкиСправочника(ИмяСправочника);
			
			// Реквизиты и табличные части
			
			Если ВсеСсылкиСправочника.Реквизиты.Количество() > 0
				ИЛИ ВсеСсылкиСправочника.ТабличныеЧасти.Количество() > 0 Тогда
				
				НовыйЭлементОбъект = Строка.НовыйЭлемент.ПолучитьОбъект();
				
				Для каждого ИмяРеквизита Из ВсеСсылкиСправочника.Реквизиты Цикл
					
					Если ИмяРеквизита = ЛокализованноеИмяРеквизитаВладелец Тогда
						Продолжить; // Владельца пока не меняем, так как это будет сделано далее отдельным алгоритмом
					КонецЕсли;
					
					Если ЗначениеЗаполнено(НовыйЭлементОбъект[ИмяРеквизита]) Тогда
					
						СтрокаТСЭ = ТаблицаСкопированныхЭлементов.Найти(НовыйЭлементОбъект[ИмяРеквизита], "СтарыйЭлемент");						
						
						Если СтрокаТСЭ <> Неопределено И ЗначениеЗаполнено(СтрокаТСЭ.НовыйЭлемент) Тогда
							НовыйЭлементОбъект[ИмяРеквизита] = СтрокаТСЭ.НовыйЭлемент;
						КонецЕсли;
						
					КонецЕсли;
						
				КонецЦикла;
				
				Для каждого ОписаниеТЧ Из ВсеСсылкиСправочника.ТабличныеЧасти Цикл
				
					Для каждого СтрокаТЧ Из НовыйЭлементОбъект[ОписаниеТЧ.Имя] Цикл
						
						Если ЗначениеЗаполнено(СтрокаТЧ[ОписаниеТЧ.Реквизит]) Тогда
							
							СтрокаТСЭ = ТаблицаСкопированныхЭлементов.Найти(СтрокаТЧ[ОписаниеТЧ.Реквизит], "СтарыйЭлемент");
							
							Если СтрокаТСЭ <> Неопределено И ЗначениеЗаполнено(СтрокаТСЭ.НовыйЭлемент) Тогда
								СтрокаТЧ[ОписаниеТЧ.Реквизит] = СтрокаТСЭ.НовыйЭлемент;
							КонецЕсли;						
							
						КонецЕсли;
							
					КонецЦикла;
				
				КонецЦикла;
				
				НовыйЭлементОбъект.ДополнительныеСвойства.Вставить("ЭтоКопирование", Истина);
				НовыйЭлементОбъект.ОбменДанными.Загрузка = Истина;
				НовыйЭлементОбъект.Записать();
				
			КонецЕсли;
			
			// Подчиненные элементы
			
			Если ВсеСсылкиСправочника.ПодчиненныеСправочники.Количество() > 0 Тогда
				
				Для каждого ИмяПодчиненногоСправочника Из ВсеСсылкиСправочника.ПодчиненныеСправочники Цикл
					
					СтрокиСПодчиненными = ТаблицаСкопированныхЭлементов.НайтиСтроки(Новый Структура("ТипЭлемента", Тип("СправочникСсылка."+ИмяПодчиненногоСправочника)));
					
					Для каждого СтрокаСПодчиненным Из СтрокиСПодчиненными Цикл
					
						Если НЕ ЗначениеЗаполнено(СтрокаСПодчиненным.НовыйЭлемент) Тогда
							Продолжить;
						КонецЕсли;
						
						НовыйЭлементОбъект = СтрокаСПодчиненным.НовыйЭлемент.ПолучитьОбъект();
						
						СтрокаТСЭ = ТаблицаСкопированныхЭлементов.Найти(НовыйЭлементОбъект.Владелец, "СтарыйЭлемент");
						
						Если СтрокаТСЭ <> Неопределено И ЗначениеЗаполнено(СтрокаТСЭ.НовыйЭлемент) Тогда
							НовыйЭлементОбъект.Владелец = СтрокаТСЭ.НовыйЭлемент;
						КонецЕсли;							
												
						НовыйЭлементОбъект.ДополнительныеСвойства.Вставить("ЭтоКопирование", Истина);
						НовыйЭлементОбъект.ОбменДанными.Загрузка = Истина;
						НовыйЭлементОбъект.Записать();
						
					КонецЦикла;
					
				КонецЦикла
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Переопределяемый модуль
		//
		
		РазработкаЭлектронныхКурсовПереопределяемый.ПриКопированииЭлектронногоКурса(НовыйЭлектронныйКурс, СтарыйЭлектронныйКурс); 
		
		// Завершаем
		//
		
		ЗафиксироватьТранзакцию();
	
	Исключение
 
 		ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;	
	
	// Завершаем
	
	Возврат НовыйЭлектронныйКурсОбъект.Ссылка;
	
КонецФункции

Процедура УстановитьПометкуУдаления(ЭлектронныйКурс, ПометкаУдаления, КонтекстРедактирования = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ЭлектронныеКурсы");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ЭлектронныйКурс);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		ЭлектронныйКурсОбъект = ЭлектронныйКурс.ПолучитьОбъект();
		ЭлектронныйКурсОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
		
		// Событие переопределяемого модуля РазработкаЭлектронныхКурсовПереопределяемый
		// будет вызвано в процедуре ПриУстановкеСнятииПометкиУдаленияЭлектронногоКурса.
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриУстановкеСнятииПометкиУдаленияЭлектронногоКурса(Знач ЭлектронныйКурс, Знач ПометкаУдаления, Знач КонтекстРедактирования) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
			
		// Подчиненные элементы
		
	    УстановитьСнятьПометкуУдаленияПодчиненныхЭлементов(ЭлектронныйКурс, ПометкаУдаления);
		
		// Группы для хранения элементов
		
		ВсеГруппыХранения = РегистрыСведений.ГруппыЭлементовЭлектронныхКурсов.ВсеГруппыЭлектронногоКурса(ЭлектронныйКурс);		
		Для каждого ГруппаХранения Из ВсеГруппыХранения Цикл
		 	ГруппаХраненияОбъект  = ГруппаХранения.ПолучитьОбъект();
			ГруппаХраненияОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);			
		КонецЦикла;
		
		// Публикация (обязательно после обработки элементов)
		
		Если ПометкаУдаления Тогда
			РегистрыСведений.ПубликацииЭлектронныхКурсов.УдалитьПубликацию(ЭлектронныйКурс);
		Иначе
			РегистрыСведений.ПубликацииЭлектронныхКурсов.Опубликовать(ЭлектронныйКурс, Истина);
		КонецЕсли;			
		
		// Статистика изучения

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИзучениеЭлектронногоКурса.Ссылка КАК Ссылка,
			|	ИзучениеЭлектронногоКурса.Учащийся КАК Учащийся
			|ИЗ
			|	Документ.ИзучениеЭлектронногоКурса КАК ИзучениеЭлектронногоКурса
			|ГДЕ
			|	ИзучениеЭлектронногоКурса.ЭлектронныйКурс = &ЭлектронныйКурс";
		
		Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Учащийся) Тогда
				Продолжить; // Для совместимости с 3.1, где были тестовые документы
			КонецЕсли;
			
			ИзучениеЭлектронногоКурсаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ИзучениеЭлектронногоКурсаОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
			
			Если НЕ ПометкаУдаления Тогда
				ИзучениеЭлектронногоКурсаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		КонецЦикла;	
		
		// Переопределяемый модуль
		
		РазработкаЭлектронныхКурсовПереопределяемый.ПриУстановкеСнятииПометкиУдаленияЭлектронногоКурса(ЭлектронныйКурс, ПометкаУдаления, КонтекстРедактирования);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
 
 		ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
		
		
КонецПроцедуры

Процедура УстановитьСнятьПометкуУдаленияПодчиненныхЭлементов(Знач ЭлектронныйКурс, Знач ПометкаУдаления) Экспорт
	
	ПодчиненныеЭлементы = РазработкаЭлектронныхКурсовСлужебный.ВсеСсылкиЭлементаСправочника(ЭлектронныйКурс, Истина);
		
	Для каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
	
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("СправочникСсылка.ПоставщикиЭлектронныхКурсов") Тогда
			Продолжить; // Поставщика курса не удаляем
		КонецЕсли;		
		
		ПодчиненныйЭлементОбъект  = ПодчиненныйЭлемент.ПолучитьОбъект();
		ПодчиненныйЭлементОбъект.ДополнительныеСвойства.Вставить("ПомечатьПодчиненные", Ложь); // Так как все подчиненные есть в этом массиве ссылок
		ПодчиненныйЭлементОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
	
	КонецЦикла;			
	
КонецПроцедуры

Процедура ОбработкаПолученияФормыОбъектаЭлектронногоКурса(Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") И НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ЭлектронныеКурсы) Тогда
		
		СтандартнаяОбработка = Ложь;			
		Параметры.Вставить("ЭлектронныйКурс", Параметры.Ключ);			
		ВыбраннаяФорма = "ОбщаяФорма.ЭлектронныйКурс";			
		Возврат; // Просмотр курса, если нет прав
		
	КонецЕсли;
	
	Если Параметры.Свойство("Ключ") Тогда
		
		ТипЭлектронногоКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "Тип");
		
		Если ТипЭлектронногоКурса = Перечисления.ТипыЭлектронныхКурсов.Слайдовый
			ИЛИ ТипЭлектронногоКурса = Перечисления.ТипыЭлектронныхКурсов.Учебник
			ИЛИ ТипЭлектронногоКурса = Перечисления.ТипыЭлектронныхКурсов.Тест Тогда
			
			СтандартнаяОбработка = Ложь;				
			Параметры.Вставить("ЭлектронныйКурс", Параметры.Ключ);
			Параметры.Вставить("РежимРедактирования", Истина);				
			ВыбраннаяФорма = "ОбщаяФорма.ЭлектронныйКурс";				
			Возврат; // Редактирование курса	
			
		Иначе
			
			СтандартнаяОбработка = Ложь;
			Параметры.Вставить("ЭлектронныйКурс", Параметры.Ключ);				
			ВыбраннаяФорма = "ОбщаяФорма.ЭлектронныйКурс";								
			Возврат; // Просмотр нередактируемого курса
			
		КонецЕсли;
		
	Иначе
		
		ТипЭлектронногоКурса = Неопределено;
		
		Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Тип") Тогда
			ТипЭлектронногоКурса = Параметры.ЗначенияЗаполнения.Тип;
		КонецЕсли;
		
		Если ТипЭлектронногоКурса = Неопределено И Параметры.Свойство("ЗначениеКопирования") Тогда
			ТипЭлектронногоКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "Тип");
		КонецЕсли;			
		
		Если ТипЭлектронногоКурса = Неопределено Тогда
			ТипыКурсов = РазработкаЭлектронныхКурсовСлужебный.ТипыЭлектронныхКурсов();
			Если ТипыКурсов.Количество() > 0 Тогда
				ТипЭлектронногоКурса = ТипыКурсов[0];
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЭлектронногоКурса = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Тип нового электронного курса не задан'");
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;			
		Параметры.Вставить("РежимРедактирования", Истина);
		Параметры.Вставить("ТипЭлектронногоКурса", ТипЭлектронногоКурса);			
		ВыбраннаяФорма = "ОбщаяФорма.ЭлектронныйКурс";
		Возврат; // Создание курса
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
